''' 
8:09PM 3/11/2021
#11.Спецсимволы, экранирование символов, raw-строки
'''
# \n - Перевод строки
# \\ - Символ обратного слеша
# \' - Символ апострофа
# \" - Символ двойной кавычки
# \a - Звуковой сигнал
# \b - Эмуляция клавишы BackSpace
# \f - Перевод формата
# \r - Возврат каретки
# \t - Горизонтальная табуляция (размером в 4 )
# \v - Вертикальная табуляция
# \0 - Символ Null (не признак конца строки)
# \xhh - Символ с шестнадцатиричным кодом hh
# \000 - Символ с восмьиричным кодом ооо
# \N{id} - Индентификатор из кодовой таблицы Unicode
# \uhhhh - 16-битный символ в Unicode в шестнадцатиричной фоме
# \Uhhhhhhhh - 32-битный символ в Unicode в шестнадцатиричной форме
# \другое - Не является экранированной последовательностью
# r"D:\\Python\\Projects ... - r" - raw-Строки, выводит так, как есть
# использовать raw-Строки можно для передачи ссылок или path.