''' 
6:18 PM 3/11/2021 - закончил
#10.Основные методы строк.
'''

'''

String.upper()  -   Возвращает строку с заглавными буквами
String.lower()  -   Возвращает строку с малыми буквами
String.count(sub[,srart[, end]])    -   Определяет число вхождение подстроки в строке
String.find(sub[, start[, end]])    -   Возвращает индекс первого найденного вхождения
String.rfind(sub[, start[, end]])   -   Возвращает индекс первого найденного вхождения при поиске справа
String.lfind(sub[, start[, end]])   -   Возвращает индекс первого найденного вхождения при поиске слева
String.index(sub[, start[, end]])   -   Возвращает индекс первого найденного вхождения
String.replace(old, new, count = -1)    -   Заменяет подстроку old на new
String.isalpha()    -   Определяет: состоит ли строка целиком из буквенных символов

String.isdigit()    -   Определет: состоит ли строка целиком из цифр
String.rjust(width[, fillchar = ''])    -   Расширяет строку, добавляя символы слева
String.ljust(width[, fillchar = ''])    -   Расширяет строка, добавляя символы справа
String.split(sep=None, maxsplit=-1)     -   Разбивает строку на подстроки
String.join(список)     -   Объединяет коллекцию в строку
String.strip()    -    Удаляет пробелы и переносы строк справа и слева
String.rstrip()   -    Удаляет пробелы и переносы строк справа
String.lstrip()   -    Удаляет пробелы и переносы строк слева

'''