''' 
3:41 PM 3/11/2021
#8.Введение в строки. Базовые операции над строками.
'''

s1 = "Панда"
s2 = 'Panda'

text = ''' Я Python выучил бы только за то,
что есть популярные курсы.
Много хороших курсов '''

print(s1)
print(s2)

# конкатенация
# len, in
# len("hello") -> 5
# 'cad' in "abraCADabra" -> True

# ord('d') = 100

''' 
Как задавать обычные и многострочные строки;
что из себя представляет символ переноса строки '\n'
+ (конкатенация) - соединение строк;
* (дублирование) - размножение строкового фрагмента;
str() - функиця для преобразования аргумента в строковое представление;
len() - вычисление длины строки;
in - оператор для проверки вхождения подстроки в строку;
операторы српвнениея: == != > < >=
ord() - определение кода символа. ord('d') = 100
'''