''' 
3/11/2021
# 6. Функции print() и input(). Преобразование строк в числа 
int() и float()
'''
# a = -6.84
# b = 7
# c = 25.6
# print(a, b, c, sep="  |  ")
# sep= "", можно менять отступы на символы или увеличивать отступ 

# print("Hello", end=" | ")
# print("World")

# x = 5.75
# y = -8
# <<Координаты точки: x = 5.76; y = -8 >>
#print("Координаты точки: x = ", x, "; y = ", y, sep="")
# Python 3.6 F-строки
# print(f"Координаты точки: x = {x}; y = {y}")

# a = float(input())
# # a = int(a)
# b = abs(a)
# print(b)

# a = float(input("Введите длину прямоугольника: "))
# b = float(input("Введите ширину прямоугольника: "))

# print("Периметр: ", 2 * (a + b))

a, b, c = map(float, input("Введите две стороны прямоугольника: ").split())
print("Периметр: ", a + b + c)
