''' 
8:41PM 9/11/2021
#31.Кортжеи (tuple) и их методы.
'''

# Кортеж - это упорядоченная, но неизменяемая коллекция произвольных данных

''' 
____________________________________________________________________

tuple.count(значение) - возвращает число найденных
элементов с указанным значением;
____________________________________________________________________

tuple.index(значение[, start[, stop]]) - возвращает индекс
первого найденного элемента с указанным значением (start и stop -
необязательные параметры, индексы начала и конца поиска).
____________________________________________________________________

'''