'''
13:28PM 8/11/2021
#16.Вложенные списки, многомерный списки
'''

''' 

>>> img = [line[:], line[:], line[:], line[:], line[:]]
>>> img
[[1, 7, 6, 11, 3], [1, 7, 6, 11, 3], [1, 7, 6, 11, 3], [1, 7, 6, 11, 3], [1, 7, 6, 11, 3]]
>>> img[0]
[1, 7, 6, 11, 3]
>>> img[2]
[1, 7, 6, 11, 3]
>>> img[1]
[1, 7, 6, 11, 3]
>>> A = [[[True, False], [1,2,3]], ["matrix", "vector"]]
>>> A
[[[True, False], [1, 2, 3]], ['matrix', 'vector']]
>>> print(A)
[[[True, False], [1, 2, 3]], ['matrix', 'vector']]
>>> A[0]
[[True, False], [1, 2, 3]]
>>> A[1]
['matrix', 'vector']
>>> 
>>> A[0][1][2]
3
>>> 

'''