'''
2:51 PM
3/11/2021
# 7.Логический тип bool. Операторы сравнения и операторы and, or, not 
'''

'''
<
>
<=
>=
==
!=
#

операторы
______________
and | or | not|
______________|
x == 4        |
x кратно 2    |
              |
x % 2 == 0    |
true          |
______________|
x кратно 3    |
x % 3 == 0    |
true          |
              |
______________|
priority      |
______________|
or    |   1   |
______|_______|
and   |   2   |
______|_______|
not   |   3   |
______|_______|
      |       |__
bool  |True|False|
      |    |     |
______|____|_____|
'''
