''' 
14:00PM 7/11/2021
#15.Основные методы списков
''' 

''' 
Method      |   description
append()    -   Добавляет элемент в конец списка
insert()    -   Вставляет элемент в указанное место списка
remove()    -   Удаляе элемент по значение
pop()       -   Удаляет последний элемент, либо элемент с указанным индексом
clear()     -   Очищает список(удаляет все элементы)
copy()      -   Возвращает копию списка
count()     -   Возвращает число элементов с указанным значением
index()     -   Возвращает индекс первого найденного элемента
reverse()   -   Меняет порядок первого найденного элемента
sort()      -   Сортирует элементы списка
'''