'''
PM 8/11/2021
#20.Оператор цикла while
'''

# s = 0
# i = 1
# N = 1000


# # загаловок цикла
# while  i < N and i <= 50:
#     #тело цикла
#     s += i
#     i += 2
#     # итерация цикла - однократное выполнение цикла

# print(s)

#
#
#


# pass_true = "password"
# ps = ""

# while ps != pass_true:
#     print("______________________________")
#     ps = input("\n\tВведите пароль: ")



# print("_____________________________________________")
# print("\n\tВход в систему")


N = 20
i = 1

while i <= N:
    if i % 3 == 0:
        print(i)

    i += 1
    
print(i)